[
  {
    "name": "Portfolio Project",
    "description": "Dynamic website showcasing my experience",
    "technologies": ["TypeScript", "Angular", "Jazmine", "JSON", "Html", "Scss"],
    "link": "https://github.com/BlindMosquito/Portfolio",
    "why": "The Portfolio Project serves as a comprehensive showcase of my professional experience and skills. By utilizing TypeScript, Angular, Jazmine, JSON, HTML, and SCSS, I aimed to create an interactive portfolio that not only presents my resume but also demonstrates my expertise in frontend development. Throughout the development process, I honed my knowledge of Angular and gained valuable experience in Unit Testing with TypeScript."
  },
  {
    "name": "Dwelmer",
    "description": "Java application for quick screenshots",
    "technologies": [ "Java" ],
    "link": "https://github.com/BlindMosquito/dwelmer",
    "why": "During a web security class, I found myself in need of a quick and efficient way to capture screenshots. Dwelmer was born out of this necessity, providing a simple Java application to perform snipping-tool-like screen captures. The project allowed me to work with screen pixels and handle multiple monitor layouts, expanding my Java programming skills and solving a practical problem at the same time."
  },
  {
    "name": "Forex Helper",
    "description": "MetaTrader 4 program for automated currency pair trading",
    "technologies": [ "MQL4", "C++", "MetaTrader" ],
    "link": "https://github.com/BlindMosquito/ForexHelper",
    "why": "With a passion for programming in C++ and an interest in forex stock strategies, I delved into creating Forex Helper using MQL4 and C++. The program automates buying and selling currency pairs in MetaTrader 4, allowing me to explore algorithmic trading and deepen my expertise in financial markets."
  },
  {
    "name": "RustProof",
    "description": "Innovative Rust compiler plugin for verifying conditions and functions",
    "technologies": [ "Rust" ],
    "link": "https://github.com/BlindMosquito/rustproof",
    "why": "As a capstone project at Portland State University, I chose to work on RustProof due to its challenging nature and intriguing possibilities. Being a Rust compiler plugin, it offered an opportunity to verify conditions and functions within Rust code. During development, my team and I explored the relatively uncharted territory of Rust, even reaching out to Rust developers for insights. This project significantly expanded my knowledge of Rust and compiler plugin architecture."
  }
]
