[
  {
    "business": "SMArtX Advisory",
    "role": "Junior Software Engineer",
    "startDate": "2022-06-01",
    "endDate": "2023-06-01",
    "description": "At SMArtX Advisory, I was part of the Market Data Squad responsible for maintaining and updating stock market data, symbols, and prices for our turnkey asset management platform. One of my key projects was the 'Database Sync Tool Runner,' where we needed to synchronize multiple databases using AWS Serverless Lambdas. To overcome the execution limit, I implemented a solution with AWS SQS and SQL Server to break up tasks and run them synchronously.",
    "projects": [
      {
        "name": "Database Sync Tool Runner",
        "description": "Developed a system to synchronize multiple databases using AWS Serverless Lambdas. Employed AWS SQS and SQL Server to break up tasks and run them synchronously.",
        "technologies": [ ".Net Core", "AWS Lambda", "AWS SQS", "AWS CloudWatch", "AWS SNS and Alarm", "SQL Server", "Liquibase", "Docker", "TypeScript", "AWS CDK" ]
      },
      {
        "name": "Secret Password Manager",
        "description": "Implemented AWS Secrets Manager and Secrets Manager Cache to quickly look up and create database connection strings based on user AWS credentials.",
        "technologies": [ ".Net Core", "AWS Secret Manager", "AWS Secret Manager Cache", ".Net Nuget Packages", "JSON" ]
      },
      {
        "name": "Load Balancing API",
        "description": "Created load balancing tests for APIs and posted results to Amazon CloudWatch.",
        "technologies": [ "K6", "TypeScript", "Docker", "AWS CloudWatch" ]
      }
    ]
  },
  {
    "business": "Gohman Mechanical",
    "role": "IT Specialist",
    "startDate": "2012-01-01",
    "endDate": "2022-01-01",
    "description": "At Gohman Mechanical, I started my career as a Construction Assistant and transitioned to the IT department while pursuing a degree in computer science. I discovered the inefficiencies in using Excel for reports and shifted to .Net and SQL Server, igniting my passion for software development. I built automation projects to assist the company and managed the IT department concurrently.",
    "projects": [
      {
        "name": "Gohman Mechanical Website",
        "description": "Designed and developed a simple web application showcasing company information and projects. Recently, the website was replaced with a Wix site to facilitate easier updates for current employees.",
        "technologies": [ "Angular", "TypeScript", "SCSS", "HTML","Nginx", "Ubuntu Server" ]
      },
      {
        "name": "Construction Quote Tracker",
        "description": "Developed a solution to track information acquired during the bidding phase of construction projects.",
        "technologies": [ ".Net Framework", "WinForms", "SQL Server", "Microsoft Access" ]
      },
      {
        "name": "Price Markup Calculator",
        "description": "Designed a small Android application that service technicians use to provide vendor pricing and markup details to customers in the field.",
        "technologies": [ "Android", "Java" ]
      },
      {
        "name": "Service Quote Estimator",
        "description": "Developed an Excel-based tool to create quotes for service repairs efficiently.",
        "technologies": [ "Excel", "VBA" ]
      },
      {
        "name": "Transit and Tax Lookup",
        "description": "Implemented a web scraper tool to look up tax and transit information based on job site addresses, assisting with payroll analysis and reporting.",
        "technologies": [ ".Net Framework" ]
      }
    ]
  },
  {
    "business": "Gohman Mechanical",
    "role": "Construction Assistant",
    "startDate": "2008-01-01",
    "endDate": "2022-01-01",
    "description": "I joined Gohman Mechanical as an expeditor, delivering equipment and material to job sites. Through college classes on AutoCAD, I transitioned to the office and provided assistance with drawings, accounts payable, and accounts receivable for construction projects. Over time, I expanded my role into designing, quoting, permitting, and collaborating with general contractors and architects on a diverse range of projects."
  }
]
